{"text":"My name is Bagrat. And I really hope you took previous line seriously. I’m a frontend developer. I enjoy creating systems and solutions for complex problems. But this isn’t a LinkedIn page, this is my safe space. Here I’ll try to form my manifest.",
"text1": "The tech still excites me, but over the time I started to look for something more than another frontend framework or development pattern. I want to use my tech skills as a tool for crafting pieces that could be classified as art. Something that one can FEEL.",
"text2": "I'll try to explain this. While at work I spend my time creating efficient solutions where I’m min-maxing every aspect of a problem, in my personal life I’m more in favor of “form over function” approach. I’m ready to sacrifice functionality if it’ll make final form simpler. I’m riding fixed gear bike because it’s simple. I don’t have any accessories attached to my bike, just to keep it simple. I’m ok with paying more effort pedaling it and carrying a backpack with U-lock and detachable lights. But having something simple usually is about sacrificing something. I’m not a masochist, I just don’t afraid of limitations, I think limitation sparks creativity.I like my keyboards to have less buttons than usual (e.g. I don’t have arrow keys), so I had to be creative and come up with my own shortcuts for such keyboards, now I don’t move my elbows when typing.Being simple doesn’t always mean to be primitive. Usually it requires complex solution “under the hood” to support the simplicity. I spent a lot of time creating an Animation component that requires 0 configuration. It’s very simple on surface but very complex behind the curtains.I spent a lot of time disassembling, modding and assembling back every single button of my keyboard, persuingThis isn’t a minimalism by any mean. I would say I just like disproportion of simplicity and the way this simplicity achieved. Think of Malevich square. Yes, this is how I end up going after art via tech, nobody expect any function from art, so it can look as simple as I want and I have skills to achieve this simplicity."}

